{
  "url": "https://www.fool.com/investing/2025/03/19/why-bitcoin-ethereum-and-dogecoin-are-soaring-toda/",
  "title": "Why Bitcoin, Ethereum, and Dogecoin Are Soaring Today",
  "date": "11 hours ago",
  "author": "https://www.facebook.com/themotleyfool/",
  "description": "",
  "content": "Free Article\nYou're reading a free article with opinions that may differ\n       from The Motley Fool's Premium Investing Services. Become a Motley Fool member today to\nget instant access to our top analyst recommendations, in-depth research, investing resources,\nand more.\nLearn More\nWhy Bitcoin, Ethereum, and Dogecoin Are Soaring Today\nBy\nJohnny Rice\n–\n  \n    \n      Mar 19, 2025 at 3:46PM\nKey Points\nThe SEC is dropping its suit against XRP, boosting the whole market.\nEthereum continues to dominate the growing stablecoin market.\nDogecoin has a new racing partnership.\nInvestor Alert: Our 10 best stocks to buy right now ›\nCRYPTO: DOGE\nDogecoin\nMarket Cap\n$29B\nToday's Change\nArrow-Thin-Down\n(-2.23%) -$0.00\nCurrent Price\n$0.20\nPrice as of March 27, 2025, 3:49 a.m. ET\nThe \"big three\" cryptocurrencies are on the move today.\nBitcoin\n(\nBTC\n-1.10%\n)\n,\nEthereum\n(\nETH\n-2.22%\n)\n, and\nDogecoin\n(\nDOGE\n-2.23%\n)\nare up 2.9%, 7.3%, and 3%, respectively, as of 2:30 p.m. ET. Earlier in the day, however, they were up as much as 3.6%, 8.7%, and 4.7%, respectively. The\nS&P 500\nis up 0.8% and the\nNasdaq Composite\nis up 1.1%.\nAll three cryptocurrencies got a boost from news that the SEC's appeal in its case against\nXRP\nwould be dropped, a major step that confirms the Trump administration's softer approach to crypto regulation, boosting the whole market.\nSEC backs off\nRipple, the company behind XRP\n, announced that the SEC is abandoning its appeal in the long-running legal battle against the company. The case dates back to 2020 when the SEC sued Ripple for allegedly selling unregistered securities. Ripple scored a partial victory last year when a judge ruled XRP wasn't a security when sold to retail investors -- though institutional sales were different. The SEC appealed this decision, but now, after a change in leadership, the regulator is dropping its appeal.\nThis development comes amid a sweeping reversal of the previous administration's crypto crackdown. The SEC recently ended its\nCoinbase Global\ncase, closed investigations into several crypto companies, scaled back enforcement, and declared\nmeme coins\naren't securities. It's clear that the Trump administration's SEC will not take a hard line in regulating the nascent industry; investors reacted positively.\nEthereum's Stablecoin dominance continues\nThe crypto market has seen some turbulence in the last few months. However, stablecoins like\nUSDC\nhave seen remarkable inflows of capital. The coins, which are fixed in value, are growing in popularity as a sort of digital cash. Most stablecoins exist on a parent blockchain and Ethereum dominates the space. It was reported yesterday that Ethereum's four-month average trading volume for these stablecoins reached $850 billion. The continued dominance shows Ethereum is still holding its lead as the preferred \"smart contract\" blockchain as others have proliferated.\nDogecoin's new sponsorship\nThe House of Doge and Dogecoin Foundation, organizations that support and promote the cryptocurrency and meme coin, announced a new partnership today. The two are teaming up with IndyCar driver Devlin DeFrancesco and Rahal Letterman Lanigan Racing to bring Dogecoin to the 109th running of the Indianapolis 500.\nThe Dogecoin Racing initiative will let fans vote on DeFrancesco's car design for the May 25 race, so long as the iconic Shiba Inu dog is at the center of the design. The partnership will also include a donation platform supporting a cause important to the team.\nThe Indianapolis 500 draws over 350,000 in-person spectators and many more around the world. Investors see this as an opportunity to boost Dogecoin's profile.\nMacro trends don't look great\nThe Federal Reserve announced today that there were no changes to the current interest rate plan. The reserve is still projecting modest GDP growth and relatively mild inflation, so fears of a recession or \"stagflation\" -- little to no GDP growth with high inflation -- were not echoed by Fed Chair Jerome Powell. That's good news for now.\nHowever, Powell has indicated that the current environment makes predicting the future particularly difficult. There is a lot of uncertainty in the market at the moment. So, while recent developments helped boost the big three cryptocurrencies, they are still volatile assets, especially Dogecoin, a meme coin. They are highly sensitive to broader economic conditions and rising uncertainty. A looser regulatory environment could be offset by the uncertainty Trump's trade tariffs and foreign policy bring.\nJohnny Rice\nhas no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Bitcoin, Coinbase Global, Ethereum, and XRP. The Motley Fool has a\ndisclosure policy\n.\nStocks Mentioned\nDogecoin\nDOGE\n$0.20\n(-2.23%)\n$0.00\nBitcoin\nBTC\n$87,296.00\n(-1.10%)\n$-971.83\nEthereum\nETH\n$2,026.60\n(-2.22%)\n$-46.01\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\nWhy Dogecoin, Shiba Inu, and Pepe Are Among the Top Meme Coins Surging Today\nShould You Buy Dogecoin While It's Under $1?\nWhere Will Dogecoin Be in 1 Year?\nIs Dogecoin the Smartest Investment You Can Make Today?\nWhere Will Dogecoin Be in 1 Year?",
  "markdown": "Free Article You're reading a free article with opinions that may differ from The Motley Fool's Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Why Bitcoin, Ethereum, and Dogecoin Are Soaring Today By Johnny Rice – Mar 19, 2025 at 3:46PM Key Points The SEC is dropping its suit against XRP, boosting the whole market. Ethereum continues to dominate the growing stablecoin market. Dogecoin has a new racing partnership. Investor Alert: Our 10 best stocks to buy right now › CRYPTO: DOGE Dogecoin Market Cap $29B Today's Change Arrow-Thin-Down (-2.23%) -$0.00 Current Price $0.20 Price as of March 27, 2025, 3:49 a.m. ET The \"big three\" cryptocurrencies are on the move today. Bitcoin ( BTC -1.10% ) , Ethereum ( ETH -2.22% ) , and Dogecoin ( DOGE -2.23% ) are up 2.9%, 7.3%, and 3%, respectively, as of 2:30 p.m. ET. Earlier in the day, however, they were up as much as 3.6%, 8.7%, and 4.7%, respectively. The S&P; 500 is up 0.8% and the Nasdaq Composite is up 1.1%. All three cryptocurrencies got a boost from news that the SEC's appeal in its case against XRP would be dropped, a major step that confirms the Trump administration's softer approach to crypto regulation, boosting the whole market. SEC backs off Ripple, the company behind XRP , announced that the SEC is abandoning its appeal in the long-running legal battle against the company. The case dates back to 2020 when the SEC sued Ripple for allegedly selling unregistered securities. Ripple scored a partial victory last year when a judge ruled XRP wasn't a security when sold to retail investors -- though institutional sales were different. The SEC appealed this decision, but now, after a change in leadership, the regulator is dropping its appeal. This development comes amid a sweeping reversal of the previous administration's crypto crackdown. The SEC recently ended its Coinbase Global case, closed investigations into several crypto companies, scaled back enforcement, and declared meme coins aren't securities. It's clear that the Trump administration's SEC will not take a hard line in regulating the nascent industry; investors reacted positively. Ethereum's Stablecoin dominance continues The crypto market has seen some turbulence in the last few months. However, stablecoins like USDC have seen remarkable inflows of capital. The coins, which are fixed in value, are growing in popularity as a sort of digital cash. Most stablecoins exist on a parent blockchain and Ethereum dominates the space. It was reported yesterday that Ethereum's four-month average trading volume for these stablecoins reached $850 billion. The continued dominance shows Ethereum is still holding its lead as the preferred \"smart contract\" blockchain as others have proliferated. Dogecoin's new sponsorship The House of Doge and Dogecoin Foundation, organizations that support and promote the cryptocurrency and meme coin, announced a new partnership today. The two are teaming up with IndyCar driver Devlin DeFrancesco and Rahal Letterman Lanigan Racing to bring Dogecoin to the 109th running of the Indianapolis 500. The Dogecoin Racing initiative will let fans vote on DeFrancesco's car design for the May 25 race, so long as the iconic Shiba Inu dog is at the center of the design. The partnership will also include a donation platform supporting a cause important to the team. The Indianapolis 500 draws over 350,000 in-person spectators and many more around the world. Investors see this as an opportunity to boost Dogecoin's profile. Macro trends don't look great The Federal Reserve announced today that there were no changes to the current interest rate plan. The reserve is still projecting modest GDP growth and relatively mild inflation, so fears of a recession or \"stagflation\" -- little to no GDP growth with high inflation -- were not echoed by Fed Chair Jerome Powell. That's good news for now. However, Powell has indicated that the current environment makes predicting the future particularly difficult. There is a lot of uncertainty in the market at the moment. So, while recent developments helped boost the big three cryptocurrencies, they are still volatile assets, especially Dogecoin, a meme coin. They are highly sensitive to broader economic conditions and rising uncertainty. A looser regulatory environment could be offset by the uncertainty Trump's trade tariffs and foreign policy bring. Johnny Rice has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Bitcoin, Coinbase Global, Ethereum, and XRP. The Motley Fool has a disclosure policy . Stocks Mentioned Dogecoin DOGE $0.20 (-2.23%) $0.00 Bitcoin BTC $87,296.00 (-1.10%) $-971.83 Ethereum ETH $2,026.60 (-2.22%) $-46.01 *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Why Dogecoin, Shiba Inu, and Pepe Are Among the Top Meme Coins Surging Today Should You Buy Dogecoin While It's Under $1? Where Will Dogecoin Be in 1 Year? Is Dogecoin the Smartest Investment You Can Make Today? Where Will Dogecoin Be in 1 Year?\n",
  "image": "https://g.foolcdn.com/editorial/images/811817/shiba-inu-dog-doge-dogecoin-601x400-f5be660.jpeg",
  "source": "The Motley Fool",
  "snippet": "The \"big three\" cryptocurrencies are on the move today. Bitcoin (BTC 3.05%), Ethereum (ETH 4.09%), and Dogecoin (DOGE 3.56%) are up 2.9%, 7.3%, and 3%,...",
  "clean_content": "Free Article You're reading a free article with opinions that may differ from The Motley Fool's Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn More Why Bitcoin, Ethereum, and Dogecoin Are Soaring Today By Johnny Rice – Mar 19, 2025 at 3:46PM Key Points The SEC is dropping its suit against XRP, boosting the whole market. Ethereum continues to dominate the growing stablecoin market. Dogecoin has a new racing partnership. Investor Alert: Our 10 best stocks to buy right now › CRYPTO: DOGE Dogecoin Market Cap $29B Today's Change Arrow-Thin-Down (-2.23%) -$0.00 Current Price $0.20 Price as of March 27, 2025, 3:49 a.m. ET The \"big three\" cryptocurrencies are on the move today. Bitcoin ( BTC -1.10% ) , Ethereum ( ETH -2.22% ) , and Dogecoin ( DOGE -2.23% ) are up 2.9%, 7.3%, and 3%, respectively, as of 2:30 p.m. ET. Earlier in the day, however, they were up as much as 3.6%, 8.7%, and 4.7%, respectively. The S&P; 500 is up 0.8% and the Nasdaq Composite is up 1.1%. All three cryptocurrencies got a boost from news that the SEC's appeal in its case against XRP would be dropped, a major step that confirms the Trump administration's softer approach to crypto regulation, boosting the whole market. SEC backs off Ripple, the company behind XRP , announced that the SEC is abandoning its appeal in the long-running legal battle against the company. The case dates back to 2020 when the SEC sued Ripple for allegedly selling unregistered securities. Ripple scored a partial victory last year when a judge ruled XRP wasn't a security when sold to retail investors -- though institutional sales were different. The SEC appealed this decision, but now, after a change in leadership, the regulator is dropping its appeal. This development comes amid a sweeping reversal of the previous administration's crypto crackdown. The SEC recently ended its Coinbase Global case, closed investigations into several crypto companies, scaled back enforcement, and declared meme coins aren't securities. It's clear that the Trump administration's SEC will not take a hard line in regulating the nascent industry; investors reacted positively. Ethereum's Stablecoin dominance continues The crypto market has seen some turbulence in the last few months. However, stablecoins like USDC have seen remarkable inflows of capital. The coins, which are fixed in value, are growing in popularity as a sort of digital cash. Most stablecoins exist on a parent blockchain and Ethereum dominates the space. It was reported yesterday that Ethereum's four-month average trading volume for these stablecoins reached $850 billion. The continued dominance shows Ethereum is still holding its lead as the preferred \"smart contract\" blockchain as others have proliferated. Dogecoin's new sponsorship The House of Doge and Dogecoin Foundation, organizations that support and promote the cryptocurrency and meme coin, announced a new partnership today. The two are teaming up with IndyCar driver Devlin DeFrancesco and Rahal Letterman Lanigan Racing to bring Dogecoin to the 109th running of the Indianapolis 500. The Dogecoin Racing initiative will let fans vote on DeFrancesco's car design for the May 25 race, so long as the iconic Shiba Inu dog is at the center of the design. The partnership will also include a donation platform supporting a cause important to the team. The Indianapolis 500 draws over 350,000 in-person spectators and many more around the world. Investors see this as an opportunity to boost Dogecoin's profile. Macro trends don't look great The Federal Reserve announced today that there were no changes to the current interest rate plan. The reserve is still projecting modest GDP growth and relatively mild inflation, so fears of a recession or \"stagflation\" -- little to no GDP growth with high inflation -- were not echoed by Fed Chair Jerome Powell. That's good news for now. However, Powell has indicated that the current environment makes predicting the future particularly difficult. There is a lot of uncertainty in the market at the moment. So, while recent developments helped boost the big three cryptocurrencies, they are still volatile assets, especially Dogecoin, a meme coin. They are highly sensitive to broader economic conditions and rising uncertainty. A looser regulatory environment could be offset by the uncertainty Trump's trade tariffs and foreign policy bring. Johnny Rice has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Bitcoin, Coinbase Global, Ethereum, and XRP. The Motley Fool has a disclosure policy . Stocks Mentioned Dogecoin DOGE $0.20 (-2.23%) $0.00 Bitcoin BTC $87,296.00 (-1.10%) $-971.83 Ethereum ETH $2,026.60 (-2.22%) $-46.01 *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Why Dogecoin, Shiba Inu, and Pepe Are Among the Top Meme Coins Surging Today Should You Buy Dogecoin While It's Under $1? Where Will Dogecoin Be in 1 Year? Is Dogecoin the Smartest Investment You Can Make Today? Where Will Dogecoin Be in 1 Year?\n",
  "markdown_file": "markdown/markdown_2025_03_27_15_50/why-bitcoin-ethereum-and-dogecoin-are-soaring-toda.md"
}