{
  "url": "https://cryptonews.com/exclusives/trumps-tariffs-spark-market-carnage-whats-next-for-bitcoin/",
  "title": "Trump’s Tariffs Spark Market Carnage: What’s Next for Bitcoin?",
  "date": "Mon, 07 Apr 2025 14:55:49 +0000",
  "author": "Connor Sephton",
  "content": "<p>In the immediate aftermath of Donald Trump&#8217;s <a href=\"https://cryptonews.com/exclusives/liberation-day-how-will-bitcoin-react-to-trumps-tariffs/\">&#8220;Liberation Day&#8221;</a> announcement last week, crypto enthusiasts had been celebrating <a href=\"https://cryptonews.com/tags/bitcoin/\">Bitcoin&#8217;s</a> stability — even amid aggressive stock market sell-offs.</p><p>Despite the S&#038;P 500 and Nasdaq 100 plunging precipitously on Thursday and Friday, BTC mostly managed to stay above $82,000. Bloomberg Intelligence analyst James Seyffart was among those scratching his head, writing: </p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>&#8220;Genuinely shocked a bit by Bitcoin&#8217;s resilience. Would not have guessed it would hold above $80k in this type of broader market selloff of risk assets&#8230;  Hell — even Gold is down?&#8221;</p>\n</blockquote><p>Unfortunately, those loftily declaring that BTC was proving itself to be &#8220;digital gold&#8221; and a store of value spoke too soon, with <a href=\"https://cryptonews.com/news/whats-happening-in-crypto-today-daily-crypto-news-digest/\">painful sell-offs</a> gripping the crypto markets as Sunday turned to Monday.</p><p>The world&#8217;s biggest cryptocurrency <a href=\"https://cryptonews.com/news/btc-sol-xrp-drop-20-billionaire-bill-ackman-calls-for-90-day-pause-on-trumps-tariffs/\">plunged</a> from $82,700 to lows of $74,436 in a little over 12 hours — and after a delayed reaction, suffered a battering at the same time as equities in Asia and Europe.</p><div class=\"cpp-crypto-chart cpp-crypto-chart-btc\"><div class=\"cpp-chart-header\"><span class=\"cpp-chart-price\"></span><span class=\"cpp-chart-change\"></span></div><canvas class=\"cpp-chart-container\" id=\"cpp-chart-67f48bf0e5f28\"></canvas><div class=\"cpp-chart-selectors\"><button class=\"cpp-chart-selector\">24h</button><button class=\"cpp-chart-selector\">7d</button><button class=\"cpp-chart-selector\">30d</button><button class=\"cpp-chart-selector\">1y</button><button class=\"cpp-chart-selector\">All time</button></div></div><p>Hong Kong&#8217;s Hang Seng index fell by a staggering 13% as traders digested Washington and Beijing trading blows on tariffs. London&#8217;s FTSE 100 hit a one-year low, too.</p><p>And as Wall Street now starts the week, it&#8217;s been confirmed that the S&#038;P 500 is now officially in bear market territory after dropping by more than 20% from its most recent all-time high. Ouch.</p><p>Bitcoiners loathe to use this metric, claiming it isn&#8217;t a practical one for digital assets considering how volatile they are. But by this definition, BTC is well and truly in a <a href=\"https://cryptonews.com/academy/crypto-bear-market/\">bear market</a> — and now trading at a 30% discount to the all-time highs recorded back on January 20, not to mention its lowest level so far this year.</p><p>Zooming out, there are some big questions to be asked. What happens now? Is Bitcoin&#8217;s bull run officially over? And is there any chance of Trump reversing his position, meaning the markets can shoot upward again? </p><p>Let&#8217;s answer each of these in turn. First off, no one can be exactly sure what tomorrow holds — let alone next week or next month. One thing is clear: Trump isn&#8217;t spooked by all of these sell-offs, and believes these punishing tariffs are a &#8220;beautiful&#8221; and necessary thing to save the U.S. economy.</p><figure class=\"wp-block-image size-large\"><img alt=\"\" class=\"wp-image-348689\" height=\"178\" src=\"https://cimg.co/wp-content/uploads/2025/04/07141148/Screenshot-2025-04-07-at-14.31.12-1024x178.png\" width=\"1024\" /></figure><p>Billionaires, businesses, economists and many consumers don&#8217;t see it this way. They argue that this is a needless act of self-harm. And while the president has left the door open for countries to renegotiate trade deals, the attitude across the markets has been described like this: &#8220;Sell now and ask questions later.&#8221; </p><p>Even before this latest escalation in tariffs, CryptoQuant founder Ki Young Ju had declared that the <a href=\"https://cryptonews.com/news/bitcoin-bull-cycle-over-cryptoquant-ceo/\">&#8220;Bitcoin bull cycle is over&#8221;</a> — with the analyst anticipating &#8220;6 to 12 months of bearish or sideways price action.&#8221;</p><figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"><div class=\"wp-block-embed__wrapper\">\n<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\"><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> bull cycle is over, expecting 6–12 months of bearish or sideways price action. <a href=\"https://t.co/f80bnNhjy4\">pic.twitter.com/f80bnNhjy4</a></p>&mdash; Ki Young Ju (@ki_young_ju) <a href=\"https://twitter.com/ki_young_ju/status/1901776137715671191?ref_src=twsrc%5Etfw\">March 17, 2025</a></blockquote>\n</div></figure><p>Inevitably, there are also determined Bitcoiners who maintain all of this is nothing to worry about. They insist BTC will continue to rise longer-term, and the turbulence seen across global markets right now serves as a powerful illustration of why this cryptocurrency is needed.</p><p>Trump has been known to perform U-turns in the past — and earlier in his presidency, he did delay tariffs on the likes of Mexico and Canada. But it&#8217;s important to realize the significance of what&#8217;s happening and accept that, even in the unlikely event that the president undid everything he unveiled on &#8220;Liberation Day,&#8221; it&#8217;ll take a long time for the markets to trust him again. As OMFIF recently noted:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>&#8220;Trump has tossed aside America’s soft power. The world has lost trust in the U.S. and can no longer regard it as a reliable partner.&#8221;</p>\n</blockquote><p>Some analysts predict that Wall Street&#8217;s role at the beating heart of the global economy could diminish over time, especially as major economies seek alternatives to the U.S. by forging trade alliances with each other.</p><p>And while Trump has been <a href=\"https://cryptonews.com/exclusives/opinion-reaction-to-trumps-bitcoin-reserve-has-been-weird/\">one of the few world leaders to embrace Bitcoin</a> — and spend political capital by pushing forward pro-crypto policies — his actions now could make BTC toxic by association.</p><p>Whether we&#8217;re talking about stocks or crypto, this isn&#8217;t a conventional bear market — and the full ramifications of &#8220;Liberation Day&#8221; could take months or years to untangle.</p><p>There&#8217;s been a fatal blow to investor confidence and sentiment, and the realization that one of the most unpredictable and erratic presidents in history will be overseeing the U.S. economy for the next four years. The <a href=\"https://cryptonews.com/news/recession-odds-surge-to-61-on-kalshi-after-trumps-tariff-order/\">odds of a recession</a> are edging higher with every passing day.</p><p>The dollar is weakening and it&#8217;s looking more likely that the Federal Reserve will cut <a href=\"https://cryptonews.com/academy/how-do-inflation-interest-rates-and-other-economic-indicators-affect-crypto/\">interest rates</a> sooner rather than later. Both of these factors might prove beneficial for Bitcoin — but they&#8217;re unlikely to be the catalysts that send BTC back to six-figure territory, let alone all-time highs.</p><p>Tellingly, Polymarket currently forecasts that there&#8217;s just a 49% chance of Bitcoin&#8217;s price accelerating to new records this year — falling to a 34% likelihood of $120,000.</p><p>The crypto industry thought it was a gift when Trump entered office. Few executives will feel the same way now.</p><p>The post <a href=\"https://cryptonews.com/exclusives/trumps-tariffs-spark-market-carnage-whats-next-for-bitcoin/\">Trump&#8217;s Tariffs Spark Market Carnage: What&#8217;s Next for Bitcoin?</a> appeared first on <a href=\"https://cryptonews.com\">Cryptonews</a>.</p>",
  "markdown": "In the immediate aftermath of Donald Trump's [\"Liberation Day\"](https://cryptonews.com/exclusives/liberation-day-how-will-bitcoin-react-to-trumps-tariffs/) announcement last week, crypto enthusiasts had been celebrating [Bitcoin's](https://cryptonews.com/tags/bitcoin/) stability — even amid aggressive stock market sell-offs.\n\nDespite the S&P 500 and Nasdaq 100 plunging precipitously on Thursday and Friday, BTC mostly managed to stay above $82,000. Bloomberg Intelligence analyst James Seyffart was among those scratching his head, writing: \n\n> \"Genuinely shocked a bit by Bitcoin's resilience. Would not have guessed it would hold above $80k in this type of broader market selloff of risk assets… Hell — even Gold is down?\"\n\nUnfortunately, those loftily declaring that BTC was proving itself to be \"digital gold\" and a store of value spoke too soon, with [painful sell-offs](https://cryptonews.com/news/whats-happening-in-crypto-today-daily-crypto-news-digest/) gripping the crypto markets as Sunday turned to Monday.\n\nThe world's biggest cryptocurrency [plunged](https://cryptonews.com/news/btc-sol-xrp-drop-20-billionaire-bill-ackman-calls-for-90-day-pause-on-trumps-tariffs/) from $82,700 to lows of $74,436 in a little over 12 hours — and after a delayed reaction, suffered a battering at the same time as equities in Asia and Europe.\n\n24h7d30d1yAll time\n\nHong Kong's Hang Seng index fell by a staggering 13% as traders digested Washington and Beijing trading blows on tariffs. London's FTSE 100 hit a one-year low, too.\n\nAnd as Wall Street now starts the week, it's been confirmed that the S&P 500 is now officially in bear market territory after dropping by more than 20% from its most recent all-time high. Ouch.\n\nBitcoiners loathe to use this metric, claiming it isn't a practical one for digital assets considering how volatile they are. But by this definition, BTC is well and truly in a [bear market](https://cryptonews.com/academy/crypto-bear-market/) — and now trading at a 30% discount to the all-time highs recorded back on January 20, not to mention its lowest level so far this year.\n\nZooming out, there are some big questions to be asked. What happens now? Is Bitcoin's bull run officially over? And is there any chance of Trump reversing his position, meaning the markets can shoot upward again? \n\nLet's answer each of these in turn. First off, no one can be exactly sure what tomorrow holds — let alone next week or next month. One thing is clear: Trump isn't spooked by all of these sell-offs, and believes these punishing tariffs are a \"beautiful\" and necessary thing to save the U.S. economy.\n\nBillionaires, businesses, economists and many consumers don't see it this way. They argue that this is a needless act of self-harm. And while the president has left the door open for countries to renegotiate trade deals, the attitude across the markets has been described like this: \"Sell now and ask questions later.\"\n\nEven before this latest escalation in tariffs, CryptoQuant founder Ki Young Ju had declared that the [\"Bitcoin bull cycle is over\"](https://cryptonews.com/news/bitcoin-bull-cycle-over-cryptoquant-ceo/) — with the analyst anticipating \"6 to 12 months of bearish or sideways price action.\"\n\n> [#Bitcoin](https://twitter.com/hashtag/Bitcoin?src=hash&ref_src=twsrc%5Etfw) bull cycle is over, expecting 6–12 months of bearish or sideways price action. [pic.twitter.com/f80bnNhjy4](https://t.co/f80bnNhjy4)\n> \n> -- Ki Young Ju (@ki_young_ju) [March 17, 2025](https://twitter.com/ki_young_ju/status/1901776137715671191?ref_src=twsrc%5Etfw)\n\nInevitably, there are also determined Bitcoiners who maintain all of this is nothing to worry about. They insist BTC will continue to rise longer-term, and the turbulence seen across global markets right now serves as a powerful illustration of why this cryptocurrency is needed.\n\nTrump has been known to perform U-turns in the past — and earlier in his presidency, he did delay tariffs on the likes of Mexico and Canada. But it's important to realize the significance of what's happening and accept that, even in the unlikely event that the president undid everything he unveiled on \"Liberation Day,\" it'll take a long time for the markets to trust him again. As OMFIF recently noted:\n\n> \"Trump has tossed aside America’s soft power. The world has lost trust in the U.S. and can no longer regard it as a reliable partner.\"\n\nSome analysts predict that Wall Street's role at the beating heart of the global economy could diminish over time, especially as major economies seek alternatives to the U.S. by forging trade alliances with each other.\n\nAnd while Trump has been [one of the few world leaders to embrace Bitcoin](https://cryptonews.com/exclusives/opinion-reaction-to-trumps-bitcoin-reserve-has-been-weird/) — and spend political capital by pushing forward pro-crypto policies — his actions now could make BTC toxic by association.\n\nWhether we're talking about stocks or crypto, this isn't a conventional bear market — and the full ramifications of \"Liberation Day\" could take months or years to untangle.\n\nThere's been a fatal blow to investor confidence and sentiment, and the realization that one of the most unpredictable and erratic presidents in history will be overseeing the U.S. economy for the next four years. The [odds of a recession](https://cryptonews.com/news/recession-odds-surge-to-61-on-kalshi-after-trumps-tariff-order/) are edging higher with every passing day.\n\nThe dollar is weakening and it's looking more likely that the Federal Reserve will cut [interest rates](https://cryptonews.com/academy/how-do-inflation-interest-rates-and-other-economic-indicators-affect-crypto/) sooner rather than later. Both of these factors might prove beneficial for Bitcoin — but they're unlikely to be the catalysts that send BTC back to six-figure territory, let alone all-time highs.\n\nTellingly, Polymarket currently forecasts that there's just a 49% chance of Bitcoin's price accelerating to new records this year — falling to a 34% likelihood of $120,000.\n\nThe crypto industry thought it was a gift when Trump entered office. Few executives will feel the same way now.\n\nThe post [Trump's Tariffs Spark Market Carnage: What's Next for Bitcoin?](https://cryptonews.com/exclusives/trumps-tariffs-spark-market-carnage-whats-next-for-bitcoin/) appeared first on [Cryptonews](https://cryptonews.com).\n",
  "success": true
}