{
  "url": "https://cointelegraph.com/news/sec-crypto-trading-roundtable-hosts-uniswap-coinbase?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
  "title": "SEC crypto trading roundtable to include crypto giants Uniswap, Coinbase",
  "date": "2025-04-08",
  "author": "Jesse Coghlan",
  "content": "Jesse Coghlan 28 minutes ago SEC crypto trading roundtable to include crypto giants Uniswap, Coinbase Executives from Uniswap, Coinbase and Cumberland DRW are among the panelists in the SEC’s next crypto roundtable — firms the regulator had previously sued or probed. 245 Total views 1 Total shares Listen to article 0:00 News COINTELEGRAPH IN YOUR SOCIAL FEED The US Securities and Exchange Commission has released the list of executives from US crypto and finance giants that will take part in a roundtable discussion on crypto trading regulation. On April 7, the regulator said its upcoming April 11 roundtable will discuss how it should handle crypto trading rules, calling it “Between a Block and a Hard Place: Tailoring Regulation for Crypto Trading.” It will be the second in a series of discussions on crypto, headed by its recently-formed Crypto Task Force . Taking part are Uniswap Labs chief legal officer Katherine Minarik, Cumberland DRW associate general counsel Chelsea Pizzola and Coinbase institutional product vice president Gregory Tusar — all firms that had once been in the regulator’s scope. Under the Biden administration, the regulator sued Cumberland DRW in October and Coinbase in June 2023 for alleged securities law violations, but both lawsuits were dropped this year under the Trump administration. The SEC also started an investigation for possible enforcement action into Uniswap Labs in April 2024, which was dropped in February with no further action. Also taking part in the roundtable are New York Stock Exchange product chief Jon Herrick, crypto brokerage FalconX business lead Austin Reid, securities tokenizing firm Texture Capital CEO Richard Johnson and the University of California, Berkeley finance chair Christine Parlour. Source: SEC Dave Lauer, co-founder of the advocacy group We the Investors and Tyler Gellasch, CEO of the not-for-profit Healthy Markets Association, will also take part, while law firm Goodwin Procter partner Nicholas Losurdo will moderate the discussion. Representing the SEC will be acting chair Mark Uyeda, Crypto Task Force chief of staff Richard Gabbert and Commissioners Caroline Crenshaw and Hester Peirce. The roundtable is the second crypto-focused discussion in a series of five that the SEC dubbed the “Spring Sprint Toward Crypto Clarity.” The first was on March 21, regarding the legal status of crypto, while three future discussions will cover custody, tokenization, and decentralized finance (DeFi). SEC’s Uyeda orders review of staff crypto comments The roundtables come as the SEC, under President Donald Trump, works to revamp its oversight of the crypto industry, with its latest action being to review staff statements on crypto so they can possibly be changed or withdrawn. Uyeda said in an April 5 statement shared by the SEC on X that due to Trump’s executive order on deregulation and recommendations from the Elon Musk-led Department of Government Efficiency, or DOGE, he was reviewing seven staff statements, five of which concerned crypto. Source: SEC “The purpose of this review is to identify staff statements that should be modified or rescinded consistent with current agency priorities,” Uyeda said. Related: SEC paints ‘a distorted picture’ of USD stablecoin market — Crenshaw The first on the list was an April 2019 analysis from the Strategic Hub for Innovation and Financial Technology on how crypto sales could be investment contracts under the securities defining Howey test — an argument the agency had made to sue multiple crypto firms for legal violations. Also up for review are two Division of Investment Management statements, one from May 2021 asking investors to consider the risks of funds with exposure to Bitcoin futures and a November 2020 statement asking for feedback on whether state-chartered banks meet standards to be qualified custodians. The SEC will also look into a December 2022 Division of Corporation Finance statement that urged SEC-regulated companies to evaluate their disclosures to mention if a slew of crypto firm bankruptcies and collapses at the time impacted their business. Finally, the agency will review a Division of Examinations alert from February 2021 that said, “a number of activities related to the offer, sale and trading of digital assets that are securities present unique risks to investors.” Legal Panel: XRP win leaves Ripple a ‘bad actor’ with no crypto legal precedent set # SEC # Regulation Add reaction",
  "markdown": "[ Jesse Coghlan ](/authors/jesse-coghlan)\n\n28 minutes ago \n\n#  SEC crypto trading roundtable to include crypto giants Uniswap, Coinbase \n\nExecutives from Uniswap, Coinbase and Cumberland DRW are among the panelists in the SEC’s next crypto roundtable — firms the regulator had previously sued or probed. \n\n245  Total views \n\n1  Total shares \n\nListen to article \n\n[](https://s3.cointelegraph.com/audio/184894.c5185cf1-053c-42d3-9e20-a0f8b2ef5597.mp3 \"Download as mp3\")\n\n0:00 \n\nNews \n\nCOINTELEGRAPH IN YOUR SOCIAL FEED\n\nThe US Securities and Exchange Commission has released the list of executives from US crypto and finance giants that will take part in a roundtable discussion on crypto trading regulation.\n\nOn April 7, the regulator [said](https://www.sec.gov/newsroom/press-releases/2025-61 \"null\") its upcoming April 11 roundtable will discuss how it should handle crypto trading rules, calling it “Between a Block and a Hard Place: Tailoring Regulation for Crypto Trading.”\n\nIt will be the second in a series of discussions on crypto, headed by its recently-formed [Crypto Task Force](https://cointelegraph.com/learn/articles/sec-crypto-task-force \"null\").\n\nTaking part are Uniswap Labs chief legal officer Katherine Minarik, Cumberland DRW associate general counsel Chelsea Pizzola and Coinbase institutional product vice president Gregory Tusar — all firms that had once been in the regulator’s scope.\n\nUnder the Biden administration, the regulator sued Cumberland DRW in October and Coinbase in June 2023 for alleged securities law violations, but both [lawsuits were dropped](https://cointelegraph.com/news/sec-to-dismiss-lawsuit-cumberland-drw \"null\") this year under the Trump administration.\n\nThe SEC also started an investigation for possible enforcement action into Uniswap Labs in April 2024, which [was dropped in February](https://cointelegraph.com/news/sec-investigation-uniswap-dropped \"null\") with no further action.\n\nAlso taking part in the roundtable are New York Stock Exchange product chief Jon Herrick, crypto brokerage FalconX business lead Austin Reid, securities tokenizing firm Texture Capital CEO Richard Johnson and the University of California, Berkeley finance chair Christine Parlour.\n\nSource: [SEC](https://x.com/SECGov/status/1909313001808671109 \"https://x.com/SECGov/status/1909313001808671109\")\n\nDave Lauer, co-founder of the advocacy group We the Investors and Tyler Gellasch, CEO of the not-for-profit Healthy Markets Association, will also take part, while law firm Goodwin Procter partner Nicholas Losurdo will moderate the discussion.\n\nRepresenting the SEC will be acting chair Mark Uyeda, Crypto Task Force chief of staff Richard Gabbert and Commissioners Caroline Crenshaw and Hester Peirce.\n\nThe roundtable is the second crypto-focused discussion in a series of five that the SEC dubbed the “Spring Sprint Toward Crypto Clarity.” The first was on March 21, regarding the legal status of crypto, while three [future discussions](https://cointelegraph.com/news/sec-4-more-crypto-roundtables-trading-custody-tokenization-defi \"null\") will cover custody, tokenization, and decentralized finance (DeFi).\n\n## SEC’s Uyeda orders review of staff crypto comments\n\nThe roundtables come as the SEC, under President Donald Trump, works to revamp its oversight of the crypto industry, with its latest action being to review staff statements on crypto so they can possibly be changed or withdrawn.\n\nUyeda said in an April 5 statement [shared](https://x.com/SECGov/status/1908546943686492633 \"null\") by the SEC on X that due to Trump’s executive order on deregulation and recommendations from the Elon Musk-led Department of Government Efficiency, or DOGE, he was reviewing seven staff statements, five of which concerned crypto.\n\nSource: [SEC](https://x.com/SECGov/status/1908546943686492633 \"https://x.com/SECGov/status/1908546943686492633\")\n\n“The purpose of this review is to identify staff statements that should be modified or rescinded consistent with current agency priorities,” Uyeda said.\n\nRelated: [SEC paints ‘a distorted picture’ of USD stablecoin market — Crenshaw](https://cointelegraph.com/news/us-sec-stablecoin-guidelines-challenged-caroline-crenshaw \"null\")\n\nThe first on the list was an April 2019 analysis from the Strategic Hub for Innovation and Financial Technology on how crypto sales could be investment contracts under the securities defining Howey test — an argument the agency had made to sue multiple crypto firms for legal violations.\n\nAlso up for review are two Division of Investment Management statements, one from May 2021 asking investors to consider the risks of funds with exposure to Bitcoin futures and a November 2020 statement asking for feedback on whether state-chartered banks meet standards to be qualified custodians.\n\nThe SEC will also look into a December 2022 Division of Corporation Finance statement that urged SEC-regulated companies to evaluate their disclosures to mention if a slew of crypto firm bankruptcies and collapses at the time impacted their business.\n\nFinally, the agency will review a Division of Examinations alert from February 2021 that said, “a number of activities related to the offer, sale and trading of digital assets that are securities present unique risks to investors.” \n\nLegal Panel: [XRP win leaves Ripple a ‘bad actor’ with no crypto legal precedent set](https://cointelegraph.com/magazine/xrp-ripple-bad-actor-no-precedent-legal/ \"null\")\n\n  * [#SEC ](/tags/sec)\n  * [#Regulation ](/tags/regulation)\n\n\n\nAdd reaction \n",
  "success": true
}