{
  "url": "https://cointelegraph.com/news/crypto-lawyer-sues-homeland-security-in-effort-unmask-satoshi?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
  "title": "Lawyer sues US homeland dept to probe supposed Satoshi Nakamoto meeting",
  "date": "2025-04-08",
  "author": "Brayden Lindrea",
  "content": "Brayden Lindrea 2 hours ago Lawyer sues US homeland dept to probe supposed Satoshi Nakamoto meeting Crypto lawyer James Murphy has sued the US Department of Homeland Security to force the agency into disclosing whom it believes is Bitcoin’s creator, Satoshi Nakamoto. 1404 Total views 2 Total shares Listen to article 0:00 News COINTELEGRAPH IN YOUR SOCIAL FEED Update: April 8 at 1:01am UTC: This article has been updated to include James Murphy’s responses to two questions from Cointelegraph. A crypto lawyer has sued the US Department of Homeland Security, alleging the agency may know who created Bitcoin — compelling the department to share what it knows. The Freedom of Information Act lawsuit was filed by James Murphy, who based his accusations on claims made by DHS Special Agent Rana Saoud at a conference in April 2019, where she said a few of her colleagues had previously met with four people involved in creating Bitcoin. “My FOIA lawsuit simply asks for the notes, email and other documents relating to that alleged interview,” Murphy posted to X after announcing the April 7 suit. “IF the interview really happened as the DHS Agent claimed, there should be documentation of the substance of that meeting,” added Murphy, who goes by MetaLawMan on X. Source: James Murphy Speaking at the OffshoreAlert Conference North America in Miami in April 2019, Saoud said DHS agents met with the four people it believed to have created Bitcoin, asking what their motives were and what the “end game” is for Bitcoin. “The agents flew to California and they realized that he wasn’t alone in creating this, there were three other people, they sat down and talked with them to find out how this actually works and what the reason for it was,” Saoud said in the presentation, which is available on YouTube. If the DHS resists disclosure, Murphy said he will “pursue the case to conclusion” to solve the mystery. Murphy, however, noted that it is possible that Saoud and the other DHS agents were mistaken and did not interview the real Satoshi Nakamoto. Related: Satoshi Nakamoto turns 50 as Bitcoin becomes US reserve asset Murphy is being assisted by former Assistant US Attorney Brian Field, who specializes in Freedom of Information Act litigation. The purpose of the Freedom of Information Act is to promote transparency and accountability by granting the public access to information held by the government. 2 questions for James Murphy, aka MetaLawMan Cointelegraph asked Murphy two questions about the DHS lawsuit. Here are his responses in full. Question #1: What is your gut feeling—do you think the DHS actually interviewed the real Satoshi? Answer: “I think it’s very possible that the DHS agent was mistaken in what she said at that conference. I think DHS agents may have met with bitcoin code maintainers, or with actual Satoshi imposters. But, who knows? The DHS agent was a pretty high ranking official and was in a position to know what she was talking about. Either way, I think it will be productive to find out and hopefully resolve this question. Nothing prevents DHS from voluntarily revealing the information without need for protracted litigation.” Question #2: If the agency did speak with the four creators — who may be ordinary US citizens — why do you believe revealing their identities serves the public interest, even if it could put their safety or privacy at risk? Answer: “I don’t understand the question. The identities of the creators of all of the largest blockchain projects, like Charles Hoskinson and Vitalik Buterin etc., are all well known in the crypto community. There are also many major figures like Michael Saylor, Tim Draper and others who have amassed enormous wealth through investment in bitcoin and their identities are well known. There are hundreds of documentaries on YouTube where amateur sleuths have tried to identify Satoshi. I’m not one of them. I’m not hiring investigators to try to track down Satoshi, I’m seeking government records under transparency laws in effect in the U.S. If DHS did, in fact, learn Satoshi’s identity, then I’m not sure what the rationale is for dozens of government employees to have this information but withhold it from the general public. Our government is required to be transparent and not keep secrets from the citizens, absent a legitimate national security concern or other limited exemption. We consider this a fundamental aspect of our freedom in the USA. It is why we have something called the “Freedom of Information Act.” Transparency is good, the government hiding information from the citizenry is generally bad. I am open about the fact that I am pro-bitcoin, having been an investor in bitcoin and a bitcoin miner since 2017. I speak to groups of executives and policy makers about bitcoin and I advocate for bitcoin adoption. What I find when I give these talks is very often these audiences (who are new to bitcoin) struggle with the idea that the creator of bitcoin is unknown while the provenance of the other major crypto projects is (relatively) transparent. So, my intention is to either conclusively refute the claim of the DHS agent that they interviewed Satoshi, or achieve some transparency that will open the door to greater bitcoin adoption in the U.S. and around the globe. I support President Trump’s initiatives to establish a Strategic Bitcoin Reserve and Digital Asset Stockpile. Since the bitcoin code is open source and can only be changed through the Bitcoin Improvement Proposal (BIP) procedure, Satoshi (if he or they were identified) would have no ability to unilaterally affect changes to bitcoin. As a result, any revelation of Satoshi’s identity is unlikely to adversely impact bitcoin. It’s more likely that such transparency would be a net positive for growing bitcoin adoption. Others may have different views on that and I respect their opinions.” Efforts to identify Satoshi Nakamoto have failed The lawsuit follows a wave of recent efforts attempting to uncover Satoshi’s identity. Last October, a controversial HBO documentary claimed that Peter Todd, a Bitcoin cypherpunk, invented Bitcoin. Todd refuted that conclusion, and most industry pundits said HBO’s evidence was weak. Nick Szabo, Adam Back and Hal Finney have also had their names tied to Satoshi’s identity. Szabo and Back regularly refute claims they’re Satoshi, as did Finney before he died in 2013. Meanwhile, members of the Bitcoin community are split on whether unveiling Satoshi’s identity would be a net positive for Bitcoin. Some worry that revealing Satoshi's identity could compromise Bitcoin’s decentralized ethos and put Satoshi’s safety at risk, while others want to be reassured that Bitcoin wasn’t created by the US government. Magazine: 10 crypto theories that missed as badly as ‘Peter Todd is Satoshi’ # Bitcoin # Satoshi Nakamoto # Law # Conference # Identity # Homeland Security # Regulation Add reaction",
  "markdown": "[ Brayden Lindrea ](/authors/brayden-lindrea)\n\n2 hours ago \n\n#  Lawyer sues US homeland dept to probe supposed Satoshi Nakamoto meeting \n\nCrypto lawyer James Murphy has sued the US Department of Homeland Security to force the agency into disclosing whom it believes is Bitcoin’s creator, Satoshi Nakamoto. \n\n1404  Total views \n\n2  Total shares \n\nListen to article \n\n[](https://s3.cointelegraph.com/audio/184885.ce228852-61d6-429e-bb4c-2fbd32a0f838.mp3 \"Download as mp3\")\n\n0:00 \n\nNews \n\nCOINTELEGRAPH IN YOUR SOCIAL FEED\n\nUpdate: April 8 at 1:01am UTC: This article has been updated to include James Murphy’s responses to two questions from Cointelegraph.\n\nA crypto lawyer has sued the US Department of Homeland Security, alleging the agency may know who created Bitcoin — compelling the department to share what it knows. \n\nThe Freedom of Information Act lawsuit was [filed](https://www.schaerr-jaffe.com/wp-content/uploads/1-Compl_.pdf \"null\") by James Murphy, who based his accusations on claims made by DHS Special Agent Rana Saoud at a conference in April 2019, where she said a few of her colleagues had previously met with four people involved in creating Bitcoin.\n\n“My FOIA lawsuit simply asks for the notes, email and other documents relating to that alleged interview,” Murphy [posted](https://x.com/MetaLawMan/status/1909239172587536428 \"null\") to X after announcing the April 7 suit. \n\n“IF the interview really happened as the DHS Agent claimed, there should be documentation of the substance of that meeting,” added Murphy, who goes by [MetaLawMan on X.](https://cointelegraph.com/magazine/coinbase-sec-lawsuit-bitcoin-mining-metalawman-x-hall-of-flame/ \"null\")  \n\n\nSource: [James Murphy](https://x.com/MetaLawMan/status/1909239172587536428 \"null\")\n\nSpeaking at the OffshoreAlert Conference North America in Miami in April 2019, Saoud said DHS agents met with the four people it believed to have created Bitcoin, asking what their motives were and what the “end game” is for Bitcoin.\n\n“The agents flew to California and they realized that he wasn’t alone in creating this, there were three other people, they sat down and talked with them to find out how this actually works and what the reason for it was,” Saoud [said](https://www.youtube.com/watch?v=MAOrjlub4Qc \"null\") in the presentation, which is available on YouTube.\n\nIf the DHS resists disclosure, Murphy said he will “pursue the case to conclusion” to solve the mystery.\n\nMurphy, however, noted that it is possible that Saoud and the other DHS agents were mistaken and did not interview the real Satoshi Nakamoto. \n\nRelated: [Satoshi Nakamoto turns 50 as Bitcoin becomes US reserve asset](https://cointelegraph.com/news/satoshi-nakamoto-50-bitcoin-becomes-us-reserve-asset \"null\")\n\nMurphy is being assisted by former Assistant US Attorney Brian Field, who specializes in Freedom of Information Act litigation.\n\nThe purpose of the Freedom of Information Act is to promote transparency and accountability by granting the public access to information held by the government.\n\n## 2 questions for James Murphy, aka MetaLawMan\n\nCointelegraph asked Murphy two questions about the DHS lawsuit. Here are his responses in full. \n\nQuestion #1: What is your gut feeling—do you think the DHS actually interviewed the real Satoshi?  \n  \nAnswer: “I think it’s very possible that the DHS agent was mistaken in what she said at that conference. I think DHS agents may have met with bitcoin code maintainers, or with actual Satoshi imposters. But, who knows? The DHS agent was a pretty high ranking official and was in a position to know what she was talking about. Either way, I think it will be productive to find out and hopefully resolve this question. Nothing prevents DHS from voluntarily revealing the information without need for protracted litigation.”  \n  \nQuestion #2: If the agency did speak with the four creators — who may be ordinary US citizens — why do you believe revealing their identities serves the public interest, even if it could put their safety or privacy at risk?  \n  \nAnswer: “I don’t understand the question. The identities of the creators of all of the largest blockchain projects, like Charles Hoskinson and Vitalik Buterin etc., are all well known in the crypto community. There are also many major figures like Michael Saylor, Tim Draper and others who have amassed enormous wealth through investment in bitcoin and their identities are well known.  \n  \nThere are hundreds of documentaries on YouTube where amateur sleuths have tried to identify Satoshi. I’m not one of them. I’m not hiring investigators to try to track down Satoshi, I’m seeking government records under transparency laws in effect in the U.S. If DHS did, in fact, learn Satoshi’s identity, then I’m not sure what the rationale is for dozens of government employees to have this information but withhold it from the general public.   \n  \nOur government is required to be transparent and not keep secrets from the citizens, absent a legitimate national security concern or other limited exemption. We consider this a fundamental aspect of our freedom in the USA. It is why we have something called the “Freedom of Information Act.” Transparency is good, the government hiding information from the citizenry is generally bad.\n\nI am open about the fact that I am pro-bitcoin, having been an investor in bitcoin and a bitcoin miner since 2017. I speak to groups of executives and policy makers about bitcoin and I advocate for bitcoin adoption. What I find when I give these talks is very often these audiences (who are new to bitcoin) struggle with the idea that the creator of bitcoin is unknown while the provenance of the other major crypto projects is (relatively) transparent.\n\nSo, my intention is to either conclusively refute the claim of the DHS agent that they interviewed Satoshi, or achieve some transparency that will open the door to greater bitcoin adoption in the U.S. and around the globe. I support President Trump’s initiatives to establish a Strategic Bitcoin Reserve and Digital Asset Stockpile.   \n  \nSince the bitcoin code is open source and can only be changed through the Bitcoin Improvement Proposal (BIP) procedure, Satoshi (if he or they were identified) would have no ability to unilaterally affect changes to bitcoin. As a result, any revelation of Satoshi’s identity is unlikely to adversely impact bitcoin. It’s more likely that such transparency would be a net positive for growing bitcoin adoption. Others may have different views on that and I respect their opinions.”\n\n## Efforts to identify Satoshi Nakamoto have failed\n\nThe lawsuit follows a wave of recent efforts attempting to uncover Satoshi’s identity.  \n  \nLast October, a controversial HBO documentary claimed that Peter Todd, a Bitcoin cypherpunk,[ invented Bitcoin.](https://cointelegraph.com/news/peter-todd-named-satoshi-nakamoto-hbo-documentary \"https://cointelegraph.com/news/peter-todd-named-satoshi-nakamoto-hbo-documentary\") Todd refuted that conclusion, and most industry pundits said[ HBO’s evidence was weak.](https://cointelegraph.com/news/hbo-documentary-peter-todd-satoshi-nakamoto \"https://cointelegraph.com/news/hbo-documentary-peter-todd-satoshi-nakamoto\")\n\nNick Szabo, [Adam Back](https://cointelegraph.com/news/adam-back-on-satoshi-emails-privacy-concerns-and-bitcoins-early-days \"https://cointelegraph.com/news/adam-back-on-satoshi-emails-privacy-concerns-and-bitcoins-early-days\") and Hal Finney have also had their names tied to[ Satoshi’s identity.](https://cointelegraph.com/news/satoshi-nakamoto-identity-reveal-october-31-claims-pr-agency \"https://cointelegraph.com/news/satoshi-nakamoto-identity-reveal-october-31-claims-pr-agency\") Szabo and Back regularly refute claims they’re Satoshi, as did Finney before he died in 2013.\n\nMeanwhile, members of the Bitcoin community are split on whether unveiling Satoshi’s identity would be a net positive for Bitcoin.\n\nSome worry that revealing Satoshi's identity could compromise Bitcoin’s decentralized ethos and put Satoshi’s safety at risk, while others want to be reassured that Bitcoin [wasn’t created by the US government.](https://cointelegraph.com/magazine/big-questions-did-the-nsa-create-bitcoin/ \"https://cointelegraph.com/magazine/big-questions-did-the-nsa-create-bitcoin/\")\n\nMagazine: [10 crypto theories that missed as badly as ‘Peter Todd is Satoshi’](https://cointelegraph.com/magazine/10-crypto-theories-that-missed-as-badly-as-peter-todd-is-satoshi/ \"null\")\n\n  * [#Bitcoin ](/tags/bitcoin)\n  * [#Satoshi Nakamoto ](/tags/satoshi-nakamoto)\n  * [#Law ](/tags/law)\n  * [#Conference ](/tags/conference)\n  * [#Identity ](/tags/identity)\n  * [#Homeland Security ](/tags/homeland-security)\n  * [#Regulation ](/tags/regulation)\n\n\n\nAdd reaction \n",
  "success": true
}