{
  "url": "https://cointelegraph.com/news/why-is-the-crypto-market-down-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
  "title": "Why is the crypto market down today?",
  "date": "2025-04-07",
  "author": "Nancy Lubale",
  "content": "Nancy Lubale 5 hours ago Why is the crypto market down today? The cryptocurrency market is down today due to the escalating US-led trade war and investors’ worries that a global recession looms. 421 Total views 516 Total shares Listen to article 0:00 Markets News COINTELEGRAPH IN YOUR SOCIAL FEED The cryptocurrency market is down on April 7, with the total market capitalization dropping by 10% at the peak of the selling to $2.41 trillion. Trading volumes across the total crypto market spiked by 293% over the last 24 hours to $165.05 billion, reinforcing the intensity of the sell-side activity. Top cryptocurrencies and their 24-hour performances. Source: Coin360 While the crypto market is known for its high volatility, several unique factors contributed to this latest dip, including US President Trump’s stiff adherence to his recently announced tariffs and sharp selling in the equities and crypto market, leading to historically large liquidations. Bitcoin’s decoupling ends The crypto market sank during the early part of the Asian trading session on April 7, and US tariffs plunged investors into a risk-off mode. President Trump’s administration hit all countries with a 10% tariff starting April 5 . Trump also emphasized that there would be no deal with China, worsening Black Monday’s bearish sentiment. In response, Bitcoin ( BTC ) tumbled as low as $74,434 on Bistamp for the first time since Nov. 6, 2024. Ether ( ETH ) extended its three-day losses, dipping as low as $1,400 on April 7, marking 16% losses over the last 24 hours. XRP ( XRP ), Solana ( SOL ) and BNB Chain’s BNB also witnessed significant losses, down 15.5%, 15.3% and 8%, respectively. Performance of top cryptocurrencies. Source: CoinMarketCap Fears of renewed inflation are intensifying, as the tariffs are expected to lead to an “economic nuclear war,” according to hedge funder Bill Ackman . The risk of higher-than-anticipated inflation is also leading market participants to boost their estimate of Federal Reserve interest rate cuts in the near future. The odds of a 25 basis point rate decrease are now up 42% compared to 14% a week ago. Target rate potential for June 18 Fed meeting. Source: CME Over $1.4 billion in crypto liquidations accompany market crash More than $1.4 billion in crypto positions have been liquidated in the last 24 hours. Almost $1.22 billion of those are long positions. This marked one of the largest liquidation events in the history of Web3, mirroring events like the Covid-19 market crash and the FTX debacle . Crypto market liquidation heatmap. Source: CoinGlass Over 460,996 traders were liquidated in the past day, with the largest single liquidations taking place on OKX involving a BTC/USD swap worth $7 million. This scale of liquidations not only exacerbates price drops but also instills fear among other market participants, leading to further selling pressure. Over $350 billion wiped off the crypto market The total market capitalization of all cryptocurrencies (TOTAL) dropped by over 13% from a high of $2.67 trillion on April 5 to an intra-day low of $2.31 trillion on April 7, as per data from Cointelegraph Markets Pro and TradingView . This marks an over $350 billion loss over a span of three days. Although TOTAL has since recovered to $2.4 trillion at the time of writing, it is down 35% from the all-time high of $3.73 reached on Dec. 17, 2023. As earlier reported by Cointelegraph, the US-led trade war could upend investors’ risk-asset sentiment, driving crypto prices even lower. This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision. # Bitcoin # Cryptocurrencies # Federal Reserve # Central Bank # Ethereum # Bitcoin Price # Economy # Markets # Stocks # Inflation # Stablecoin Add reaction",
  "markdown": "[ Nancy Lubale ](/authors/nancy-lubale)\n\n5 hours ago \n\n#  Why is the crypto market down today? \n\nThe cryptocurrency market is down today due to the escalating US-led trade war and investors’ worries that a global recession looms. \n\n421  Total views \n\n516  Total shares \n\nListen to article \n\n[](https://s3.cointelegraph.com/audio/93908.4056399e-0ebc-46ce-80f0-8a2b3d1bd970.mp3 \"Download as mp3\")\n\n0:00 \n\nMarkets News \n\nCOINTELEGRAPH IN YOUR SOCIAL FEED\n\nThe cryptocurrency market is down on April 7, with the total market capitalization dropping by 10% at the peak of the selling to $2.41 trillion. Trading volumes across the total crypto market spiked by 293% over the last 24 hours to $165.05 billion, reinforcing the intensity of the sell-side activity.\n\nTop cryptocurrencies and their 24-hour performances. Source: Coin360\n\nWhile the crypto market is known for its high volatility, several unique factors contributed to this latest dip, including US President Trump’s stiff adherence to his recently announced tariffs and sharp selling in the equities and crypto market, leading to historically large liquidations. \n\n## Bitcoin’s decoupling ends\n\nThe [crypto market sank](https://cointelegraph.com/news/crypto-plunges-nasdaq-dow-stock-futures-fall-on-open \"null\") during the early part of the Asian trading session on April 7, and [US tariffs](https://cointelegraph.com/news/timeline-trump-tariffs-bitcoin-drop \"null\") plunged investors into a risk-off mode. President Trump’s administration hit all [countries with a 10% tariff starting April 5](https://cointelegraph.com/news/president-trump-signs-reciprocal-tariff-executive-order \"null\"). Trump also emphasized that there would be no deal with China, worsening [Black Monday’s](https://cointelegraph.com/news/black-monday-2-0-5-things-bitcoin-this-week \"null\") bearish sentiment.\n\nIn response, Bitcoin ([BTC](https://cointelegraph.com/bitcoin-price \"null\")) tumbled as low as $74,434 on Bistamp for the first time since Nov. 6, 2024. Ether ([ETH](https://cointelegraph.com/ethereum-price \"null\")) extended its three-day losses, dipping as low as $1,400 on April 7, marking 16% losses over the last 24 hours. XRP ([XRP](https://cointelegraph.com/xrp-price-index \"null\")), Solana ([SOL](https://cointelegraph.com/solana-price-index \"null\")) and BNB Chain’s [BNB](https://cointelegraph.com/binance-coin-price-index \"null\") also witnessed significant losses, down 15.5%, 15.3% and 8%, respectively. \n\nPerformance of top cryptocurrencies. Source: CoinMarketCap\n\nFears of renewed inflation are intensifying, as the tariffs are expected to lead to an “economic nuclear war,” according to hedge funder [Bill Ackman](https://www.cnbc.com/2025/04/07/trump-is-losing-the-confidence-of-business-leaders-bill-ackman-says.html \"null\"). The risk of higher-than-anticipated inflation is also leading market participants to boost their estimate of Federal Reserve interest rate cuts in the near future. The odds of a 25 basis point rate decrease are now up 42% compared to 14% a week ago.\n\nTarget rate potential for June 18 Fed meeting. Source: [CME](https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html \"https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html\")\n\n## Over $1.4 billion in crypto liquidations accompany market crash\n\nMore than $1.4 billion in crypto positions have been liquidated in the last 24 hours. Almost $1.22 billion of those are long positions. This marked one of the largest liquidation events in the history of Web3, mirroring events like the [Covid-19 market crash](https://cointelegraph.com/news/coronavirus-financial-crash-is-bitcoins-biggest-test-bitmex-says \"null\") and the [FTX debacle](https://cointelegraph.com/news/ftx-fiasco-means-consequences-for-crypto-out-of-washington-dc \"null\").\n\nCrypto market liquidation heatmap. Source: CoinGlass\n\nOver 460,996 traders were liquidated in the past day, with the largest single liquidations taking place on OKX involving a BTC/USD swap worth $7 million. This scale of liquidations not only exacerbates price drops but also instills fear among other market participants, leading to further selling pressure. \n\n## Over $350 billion wiped off the crypto market\n\nThe total market capitalization of all cryptocurrencies (TOTAL) dropped by over 13% from a high of $2.67 trillion on April 5 to an intra-day low of $2.31 trillion on April 7, as per data from [Cointelegraph Markets Pro](https://subscription.cointelegraph.com/?_gl=1*7499wx*_ga*MTQ0MzQ0NzI4Ny4xNzE2MzY1NTA0*_ga_53R24TEEB1*MTcxNjM2NTUwNC4xLjEuMTcxNjM2Njg2MC4wLjAuMA.. \"null\") and [TradingView](https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE \"null\"). \n\nThis marks an over $350 billion loss over a span of three days. Although TOTAL has since recovered to $2.4 trillion at the time of writing, it is down 35% from the all-time high of $3.73 reached on Dec. 17, 2023.\n\nAs [earlier](https://cointelegraph.com/magazine/bitcoin-price-prediction-crypto-investor-spacex-mission-arthur-hayes-hodlers-digest/ \"null\") reported by Cointelegraph, the US-led [trade war could upend investors’](https://cointelegraph.com/news/bitcoin-crash-risk-to-70-k-in-10-days-increasing-analyst-says-it-s-btc-s-practical-bottom \"null\") risk-asset sentiment, driving crypto prices even lower.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\n  * [#Bitcoin ](/tags/bitcoin)\n  * [#Cryptocurrencies ](/tags/cryptocurrencies)\n  * [#Federal Reserve ](/tags/federal-reserve)\n  * [#Central Bank ](/tags/central-bank)\n  * [#Ethereum ](/tags/ethereum)\n  * [#Bitcoin Price ](/tags/bitcoin-price)\n  * [#Economy ](/tags/economy)\n  * [#Markets ](/tags/markets)\n  * [#Stocks ](/tags/stocks)\n  * [#Inflation ](/tags/inflation)\n  * [#Stablecoin ](/tags/stablecoin)\n\n\n\nAdd reaction \n",
  "success": true
}