{
  "url": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
  "title": "Here’s what happened in crypto today",
  "date": "2025-04-07",
  "author": "Cointelegraph",
  "content": "Cointelegraph 4 hours ago Here’s what happened in crypto today Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation. 1182 Total views 2 Total shares Listen to article 0:00 News COINTELEGRAPH IN YOUR SOCIAL FEED Today in crypto, Pakistan has tapped former Binance CEO Changpeng “CZ” Zhao as an adviser to its national crypto council; an Ethereum whale moved to deposit $14 million in ETH to prevent liquidation on a $340 million short position; and Bitcoin’s hashrate has officially surpassed 1 zetahash per second, marking a major milestone for the network. Pakistan appoints Changpeng Zhao as crypto adviser as adoption heats up Former Binance CEO Changpeng “CZ” Zhao has been appointed as an adviser to Pakistan’s Crypto Council, a newly formed regulatory body tasked with overseeing the country’s embrace of blockchain technology and digital assets. The appointment was confirmed by Pakistan’s finance ministry and reported by Bloomberg on April 7. Zhao will advise the regulatory body on cryptocurrency regulation, infrastructure and adoption, Bloomberg reported. In March, the CEO of Pakistan’s Crypto Council, Bilal bin Saqib, told Bloomberg that the country plans to develop a clear regulatory framework for digital assets. “Pakistan is done sitting on the sidelines,” Saqib said. “We want to attract international investment because Pakistan is a low-cost high-growth market with [...] a Web3 native workforce ready to build.” CZ is seen signing documents during his appointment by Pakistan’s Ministry of Finance. Source: Business Recorder Whale makes $14 million Ether emergency deposit to avoid $340 million liquidation An unidentified cryptocurrency whale injected millions of dollars in emergency capital to avoid a potential liquidation of more than $300 million in Ether as markets slumped amid renewed macroeconomic pressure. The whale is reportedly close to liquidation on a 220,000 Ether ( ETH ) position on MakerDAO, a decentralized finance (DeFi) lending platform. To stave off liquidation, the investor deposited 10,000 ETH — worth more than $14.5 million — and 3.54 million Dai ( DAI ) to raise the position’s liquidation price, blockchain analytics firm Lookonchain said in an April 7 post on X. “If $ETH drops to $1,119.3, the 220,000 $ETH($340M) will be liquidated.” Source: Lookonchain The development came hours after another Ether investor was liquidated for over $106 million on the decentralized finance (DeFi) lending platform Sky. The whale lost more than 67,000 ETH when the asset crashed by around 14% on April 6. Sky’s system employs an overcollateralization ratio, typically 150% or higher, meaning that users need to deposit at least $150 worth of ETH to borrow 100 DAI. Bitcoin hashrate tops 1 zetahash in historic first The Bitcoin network hashrate has topped 1 zetahash per second (ZH/s) for the first time in Bitcoin’s 16-year history, according to several blockchain data sources. Bitcoin’s hashrate crossed the milestone on April 5 at a peak of 1.025 ZH/s, according to mempool.space data, while BTC Frame data said it hit 1.02 ZH/s a day earlier. Bitcoin’s hashrate has fallen back below 0.95 ZH/s on April 7 since reaching 1 ZH/s. Source: BTC Frame Data from Coinwarz says that Bitcoin hashrate soared to as high as 1.1 ZH/s on April 4 at block height 890,915 — however, the same data indicates that Bitcoin first crossed 1 ZH/s on March 24. The Bitcoin network’s reported rise to 1 ZH/s — equivalent to 1,000 Exahashes per second — marks a 1,000x increase since late January 2016, when Bitcoin first hit 1 EH/s for the first time. # Bitcoin # Altcoin # Ethereum # SEC # United States # Cybersecurity # Stablecoin # Liquidity # Whale # Regulation # Memecoin # Policy Add reaction",
  "markdown": "[ Cointelegraph ](/authors/cointelegraph)\n\n4 hours ago \n\n#  Here’s what happened in crypto today \n\nNeed to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation. \n\n1182  Total views \n\n2  Total shares \n\nListen to article \n\n[](https://s3.cointelegraph.com/audio/110589.5cdc42fc-bcc7-47cc-a1fa-7c916dc74c79.mp3 \"Download as mp3\")\n\n0:00 \n\nNews \n\nCOINTELEGRAPH IN YOUR SOCIAL FEED\n\nToday in crypto, Pakistan has tapped former Binance CEO Changpeng “CZ” Zhao as an adviser to its national crypto council; an Ethereum whale moved to deposit $14 million in ETH to prevent liquidation on a $340 million short position; and Bitcoin’s hashrate has officially surpassed 1 zetahash per second, marking a major milestone for the network.\n\n## Pakistan appoints Changpeng Zhao as crypto adviser as adoption heats up\n\nFormer Binance CEO Changpeng “CZ” Zhao [has been appointed as an adviser](https://cointelegraph.com/news/pakistan-appoints-changpeng-zhao-crypto-adviser \"https://cointelegraph.com/news/pakistan-appoints-changpeng-zhao-crypto-adviser\") to Pakistan’s Crypto Council, a newly formed regulatory body tasked with overseeing the country’s embrace of blockchain technology and digital assets. \n\nThe appointment was confirmed by Pakistan’s finance ministry and reported by Bloomberg on April 7. Zhao will advise the regulatory body on cryptocurrency regulation, infrastructure and adoption, Bloomberg reported.\n\nIn March, the CEO of Pakistan’s Crypto Council, Bilal bin Saqib, told [Bloomberg](https://www.bloomberg.com/news/articles/2025-03-20/pakistan-plans-to-legalize-crypto-in-bid-for-foreign-investment \"null\") that the country plans to develop a clear regulatory framework for digital assets.\n\n“Pakistan is done sitting on the sidelines,” Saqib said. “We want to attract international investment because Pakistan is a low-cost high-growth market with [...] a Web3 native workforce ready to build.”\n\nCZ is seen signing documents during his appointment by Pakistan’s Ministry of Finance. Source: [Business Recorder](https://www.youtube.com/watch?v=cC0zpHDhdZo \"https://www.youtube.com/watch?v=cC0zpHDhdZo\")\n\n## Whale makes $14 million Ether emergency deposit to avoid $340 million liquidation\n\nAn unidentified cryptocurrency whale [injected millions of dollars in emergency capital](https://cointelegraph.com/news/whale-14-m-emergency-deposit-avoid-340-m-eth-liquidation \"https://cointelegraph.com/news/whale-14-m-emergency-deposit-avoid-340-m-eth-liquidation\") to avoid a potential liquidation of more than $300 million in Ether as markets slumped amid renewed macroeconomic pressure.\n\nThe whale is reportedly close to liquidation on a 220,000 Ether ([ETH](/ethereum-price \"/ethereum-price\")) position on MakerDAO, a decentralized finance (DeFi) lending platform. To stave off liquidation, the investor deposited 10,000 ETH — worth more than $14.5 million — and 3.54 million Dai ([DAI](/dai-price-index \"/dai-price-index\")) to raise the position’s liquidation price, blockchain analytics firm Lookonchain [said](https://x.com/lookonchain/status/1909147612743397440/photo/2# \"https://x.com/lookonchain/status/1909147612743397440/photo/2#\") in an April 7 post on X.\n\n> “If $ETH drops to $1,119.3, the 220,000 $ETH($340M) will be liquidated.”\n\nSource: [Lookonchain](https://x.com/lookonchain/status/1909147612743397440/photo/2# \"https://x.com/lookonchain/status/1909147612743397440/photo/2#\")\n\nThe development came hours after another [Ether investor was liquidated](https://cointelegraph.com/news/ethereum-whale-loses-106-million-maker-amid-crypto-bloodbath \"https://cointelegraph.com/news/ethereum-whale-loses-106-million-maker-amid-crypto-bloodbath\") for over $106 million on the decentralized finance (DeFi) lending platform Sky.\n\nThe whale lost more than 67,000 ETH when the asset crashed by around 14% on April 6. Sky’s system employs an overcollateralization ratio, typically 150% or higher, meaning that users need to deposit at least $150 worth of ETH to borrow 100 DAI.\n\n## Bitcoin hashrate tops 1 zetahash in historic first\n\nThe Bitcoin network hashrate has topped 1 zetahash per second (ZH/s) for the first time in Bitcoin’s 16-year history, according to several blockchain data sources.\n\nBitcoin’s hashrate crossed the milestone on April 5 at a peak of 1.025 ZH/s, [according](https://mempool.space/graphs/mining/hashrate-difficulty#2y \"null\") to mempool.space data, while BTC Frame data [said](https://btcframe.com/dashboard.html#page6 \"null\") it hit 1.02 ZH/s a day earlier.\n\nBitcoin’s hashrate has fallen back below 0.95 ZH/s on April 7 since reaching 1 ZH/s. Source: [BTC Frame](https://btcframe.com/dashboard.html#page5 \"null\")\n\nData from Coinwarz says that Bitcoin hashrate soared to as high as 1.1 ZH/s on April 4 at block height 890,915 — however, the same data indicates that Bitcoin first crossed 1 ZH/s on March 24.\n\nThe Bitcoin network’s reported rise to 1 ZH/s — equivalent to 1,000 Exahashes per second — marks a 1,000x increase since late January 2016, when Bitcoin first hit 1 EH/s for the first time. \n\n  * [#Bitcoin ](/tags/bitcoin)\n  * [#Altcoin ](/tags/altcoin)\n  * [#Ethereum ](/tags/ethereum)\n  * [#SEC ](/tags/sec)\n  * [#United States ](/tags/united-states)\n  * [#Cybersecurity ](/tags/cybersecurity)\n  * [#Stablecoin ](/tags/stablecoin)\n  * [#Liquidity ](/tags/liquidity)\n  * [#Whale ](/tags/whale)\n  * [#Regulation ](/tags/regulation)\n  * [#Memecoin ](/tags/memecoin)\n  * [#Policy ](/tags/policy)\n\n\n\nAdd reaction \n",
  "success": true
}