{
  "url": "https://cointelegraph.com/news/janover-price-rises-1000-with-new-crypto-ownership-sol-treasury-plans?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
  "title": "Former Kraken execs acquire real state firm Janover, disclose SOL treasury plans",
  "date": "2025-04-07",
  "author": "Christopher Tepedino",
  "content": "Christopher Tepedino 4 hours ago Former Kraken execs acquire real state firm Janover, disclose SOL treasury plans The new ownership group is made up of former Kraken employees who seek to make Janover a bet on Solana. 2050 Total views Listen to article 0:00 News COINTELEGRAPH IN YOUR SOCIAL FEED A team of former Kraken executives has taken control of Janover, with Joseph Onorati, former chief strategy officer at Kraken, stepping in as chairman and CEO, following the group's purchase of over 700,000 common shares and all Series A preferred stock. Parker White, former director of engineering at Kraken, was appointed as the new chief investment officer and chief operating officer. The group bought 728,632 shares of Janover common stock and all 10,000 shares of Series A preferred stock. Marco Santori, former chief legal officer at Kraken, will join the board. Janover is a real estate financing company that connects lenders and buyers of commercial properties. The company stock price saw an 840% rise on April 7 as part of the deal. According to a statement, the company's new leadership has plans to create a Solana ( SOL ) reserve treasury. The plans include acquiring Solana validators, staking SOL and additional purchases of the token. Janover stock price on April 7. Source: Google Finance In tandem with the announcement, Janover revealed that it had raised $42 million in an offering of convertible notes. Convertible notes are a type of debt instrument that can later be converted to equity at a certain price. Participants in the funding round include Pantera Capital, Kraken, Arrington Capital, Protagonist, Third Party Ventures, and others. Janover announced in December 2024 that it had begun accepting payments for its real estate services in Bitcoin ( BTC ), Ether ( ETH ), and SOL. Crypto treasury companies: Bold or risky? In August 2020, Strategy became one of the first publicly traded companies to hold Bitcoin on its balance sheet . Since then, several companies have followed suit, including Japan’s Metaplanet , Semler Scientific , and Tesla . In many cases, these companies have seen rises in their share prices as investors sought exposure to digital assets through traditional financial products. Some outsiders have criticized this approach due to the cryptocurrencies’ volatility and some companies’ financing methods, such as convertible note offerings used by Strategy. SOL has seen significant volatility in the past 365 days, according to MarketVector. The coin has risen as to high as $274.50 and fallen to a low of $107.68. Magazine: Financial nihilism in crypto is over — It’s time to dream big again # Kraken # Business # United States # Solana Add reaction",
  "markdown": "[ Christopher Tepedino ](/authors/christopher-tepedino)\n\n4 hours ago \n\n#  Former Kraken execs acquire real state firm Janover, disclose SOL treasury plans \n\nThe new ownership group is made up of former Kraken employees who seek to make Janover a bet on Solana. \n\n2050  Total views \n\nListen to article \n\n[](https://s3.cointelegraph.com/audio/184876.2e0c988f-69f3-4ae4-b309-9cd3a9eb38cf.mp3 \"Download as mp3\")\n\n0:00 \n\nNews \n\nCOINTELEGRAPH IN YOUR SOCIAL FEED\n\nA team of former Kraken executives has taken control of Janover, with Joseph Onorati, former chief strategy officer at Kraken, stepping in as chairman and CEO, following the group's purchase of over 700,000 common shares and all Series A preferred stock.\n\nParker White, former director of engineering at Kraken, was appointed as the new chief investment officer and chief operating officer. The group bought 728,632 shares of Janover common stock and all 10,000 shares of Series A preferred stock. Marco Santori, former chief legal officer at Kraken, will join the board. \n\nJanover is a real estate financing company that connects lenders and buyers of commercial properties. The company stock price [saw](https://www.google.com/finance/quote/JNVR:NASDAQ \"https://www.google.com/finance/quote/JNVR:NASDAQ\") an 840% rise on April 7 as part of the deal. \n\nAccording to a statement, the company's new leadership has plans to create a Solana ([SOL](/solana-price-index \"/solana-price-index\")) reserve treasury. The plans include acquiring Solana validators, staking SOL and additional purchases of the token. \n\nJanover stock price on April 7. Source: [Google Finance](https://www.google.com/finance/quote/JNVR:NASDAQ \"https://www.google.com/finance/quote/JNVR:NASDAQ\")\n\nIn tandem with the announcement, Janover [revealed](https://www.globenewswire.com/news-release/2025/04/07/3056682/0/en/New-Janover-Management-Team-Raises-Approximately-42-Million-to-Enhance-U-S-Public-Market-Digital-Asset-Treasury-Strategy.html \"null\") that it had raised $42 million in an offering of convertible notes. Convertible notes are a type of debt instrument that can later be converted to equity at a certain price. Participants in the funding round include Pantera Capital, Kraken, Arrington Capital, Protagonist, Third Party Ventures, and others.\n\nJanover announced in December 2024 that it had begun accepting payments for its real estate services in Bitcoin ([BTC](/bitcoin-price \"null\")), Ether ([ETH](/ethereum-price \"null\")), and SOL. \n\n## Crypto treasury companies: Bold or risky?\n\nIn August 2020, Strategy became one of the first publicly traded companies [to hold Bitcoin on its balance sheet](https://cointelegraph.com/news/michael-saylor-s-strategy-makes-first-bitcoin-acquisition-under-new-name \"null\"). Since then, several companies have followed suit, including Japan’s [Metaplanet](https://cointelegraph.com/news/metaplanet-repays-bonds-ceo-comments-bitcoin-down-days \"null\"), [Semler Scientific](https://cointelegraph.com/news/semler-scientific-37-btc-yield-treasury \"null\"), and [Tesla](https://cointelegraph.com/news/tesla-still-owns-entire-bitcoin-stash-arkham-data \"null\").\n\nIn many cases, these companies [have seen rises in their share prices](https://cointelegraph.com/news/semler-scientific-adopting-bitcoin-treasury-reserve \"null\") as investors sought exposure to digital assets through traditional financial products. \n\nSome outsiders have [criticized this approach](https://cointelegraph.com/news/michael-saylor-strategy-house-of-cards \"null\") due to the cryptocurrencies’ volatility and some companies’ financing methods, such as convertible note offerings used by Strategy. \n\nSOL has seen significant volatility in the past 365 days, [according](https://www.marketvector.com/indexes/digital-assets/marketvector-solana-benchmark-rate \"null\") to MarketVector. The coin has risen as to high as $274.50 and fallen to a low of $107.68. \n\n[Magazine: Financial nihilism in crypto is over — It’s time to dream big again](https://cointelegraph.com/magazine/financial-nihilism-crypto-over-dream-big-again/ \"null\")\n\n  \n  \n\n\n  * [#Kraken ](/tags/kraken)\n  * [#Business ](/tags/business)\n  * [#United States ](/tags/united-states)\n  * [#Solana ](/tags/solana)\n\n\n\nAdd reaction \n",
  "success": true
}