{
  "title": "XRP's Return Above $2 Not Impossible, Ethereum (ETH): Road Below $1,000, Dogecoin (DOGE) 20% Plummeting: What's Next?",
  "date": "",
  "author": "",
  "url": "https://u.today/xrps-return-above-2-not-impossible-ethereum-eth-road-below-1000-dogecoin-doge-20-plummeting-whats",
  "content": "  * Ethereum hits new lows\n  * Dogecoin falls down\n\n\n\nAdvertisement\n\nIn light of the ongoing market-wide correction, [XRP](https://u.today/632-million-xrp-price-down-fundamentals-up) fell below the critical $2 threshold, which is concerning for the altcoin. As of press time, XRP is down 6% in the last day, trading at about $1.79. There was a general decline on the cryptocurrency market at the same time, but the harm to XRP's technical structure is especially concerning. \n\nA cursory examination of the chart shows that XRP has broken below the 200-day EMA, a significant long-term support that was once a springboard for bullish momentum. Now that this level has been lost, a deeper decline toward the $1.50-$1.60 support zone is possible, particularly if selling pressure continues. The Daily RSI has further descended into oversold territory, supporting the idea that bearish momentum is still in complete control. But there is still hope for XRP.\n\n![XRPUSDT](/sites/default/files/inline-images/image_1964.png)[XRP/USDT Chart by TradingView](https://www.tradingview.com/)\n\nThe robust on-chain data, especially the steady and notable increase in [XRP](https://u.today/200000000-xrp-stun-worlds-largest-exchange)'s payment volume, is one of the most encouraging counterpoints to the bearish chart structure. Notwithstanding the market decline, data indicates that on April, 7 XRP's payment volume approached $694 million, marking a significant increase in on-chain activity. \n\nHOT Stories\n\n[ ](/hot-stories \"Go to Hot stories\")\n\n[ XRP's Return Above $2 Not Impossible, Ethereum (ETH): Road Below $1,000, Dogecoin (DOGE) 20% Plummeting: What's Next? ](https://u.today/xrps-return-above-2-not-impossible-ethereum-eth-road-below-1000-dogecoin-doge-20-plummeting-whats) [ Satoshi's Portfolio Collapses by $30 Billion ](https://u.today/satoshis-portfolio-collapses-by-30-billion) [ Acting SEC Chair Says Ether Is Not a Security. What About XRP?  ](https://u.today/acting-sec-chair-says-ether-is-not-a-security-what-about-xrp) [ Breaking: XRP Collapses 8% in Minutes Because of This One Word ](https://u.today/breaking-xrp-collapses-8-in-minutes-because-of-this-one-word)\n\nThis surge shows unequivocally that XRP's usefulness and uptake are still strong. In the short run, XRP may be able to rekindle bullish momentum and invalidate the current breakdown if it can regain the $2 psychological resistance. In addition to putting the asset back above the trendline it just lost, such a move would pave the way for a recovery toward the resistance level between $2.30 and $2.50. \n\nAdvertisement\n\n## Ethereum hits new lows\n\nWith the market-wide correction pushing Ethereum's price to new multi-month lows, the cryptocurrency is in serious trouble. [ETH](https://u.today/vitalik-buterin-wont-like-this-ethereum-prediction-by-peter-schiff) has fallen to its lowest level in more than two years, below the crucial $1,500 mark. The asset, which is now trading at about $1,490, has lost over 20% of its value in a single day, and the technical picture appears to be getting worse. The market is incredibly panicked as a result of the steep decline. \n\nProminent doubters such as economist Peter Schiff have fueled the flames by declaring they do not think it will be long before it breaks below $1,000 in the near future. On the Ethereum price chart, where the breakdown from a descending channel suggests the potential for a further decline, Schiff's pessimistic forecast is in line with reality. The extreme amount of selling pressure is reflected in the RSI's plunge into oversold territory.\n\nRelated\n\n[![300 Million Dogecoin \\(DOGE\\) on Edge as Black Monday Sell-Off May Be Real](https://u.today/sites/default/files/styles/300/public/2025-04/s6731.jpg)](https://u.today/300-million-dogecoin-doge-on-edge-as-black-monday-sell-off-may-be-real)\n\nMon, 04/07/2025 - 13:46\n\n[ 300 Million Dogecoin (DOGE) on Edge as Black Monday Sell-Off May Be Real](https://u.today/300-million-dogecoin-doge-on-edge-as-black-monday-sell-off-may-be-real)\n\n[![Gamza Khanzadaev](https://u.today/sites/default/files/styles/130x/public/2022-05/14693.jpg)Gamza Khanzadaev](/gamza-khanzadaev)\n\nThe rise in trading volume that coincided with this decline, a well-known indicator of strong bearish conviction, is more worrisome. With [ETH](https://u.today/breaking-crypto-market-getting-annihilated-as-ethereum-collapses-by-10) currently trading well below all of its major moving averages, including the 200-day EMA, a quick recovery appears improbable in the absence of a significant catalyst.\n\nThe $1,200-1,300 range is the next important support, but if that does not hold, the psychological $1,000 mark becomes clear. A decline below this mark would be a huge setback for Ethereum bulls in terms of sentiment in addition to being a technical catastrophe.\n\nOn the other hand, macroeconomic and technical forces are in complete control in the near term. With the overall risk-off attitude fueled by hostilities around the world, U.S. crypto assets continue to be severely impacted by tariff policies. The path to below $1,000 is no longer impossible unless Ethereum can quickly recover the $1,600-$1,700 range and stabilize; otherwise, bearish predictions like Schiff's might soon be validated.\n\n## Dogecoin falls down\n\nThe most recent decline on the cryptocurrency market has severely hurt Dogecoin, which has fallen more than 20% in recent sessions and below the crucial support level at $0.14. [DOGE,](https://u.today/is-bitcoin-btc-headed-for-72000-dogecoin-doge-price-hit-critical-support-shiba-inus-shib-whales) which is currently trading at about $0.13, has broken through several local floors and now faces an uncertain future, particularly given that the overall market sentiment is still risk-off. New economic worries, especially the introduction of U.S. tarrifs, have triggered a broader market-wide sell-off, which includes the recent correction.\n\nRelated\n\n[![632 Million XRP: Price Down, Fundamentals Up](https://u.today/sites/default/files/styles/300/public/2025-04/s6727.jpg)](https://u.today/632-million-xrp-price-down-fundamentals-up)\n\nMon, 04/07/2025 - 13:00\n\n[ 632 Million XRP: Price Down, Fundamentals Up](https://u.today/632-million-xrp-price-down-fundamentals-up)\n\n[![Arman Shirinyan](https://u.today/sites/default/files/styles/130x/public/2021-08/8992.jpg)Arman Shirinyan](/arman-shirinyan)\n\nThere have been significant withdrawals from cryptocurrencies, including DOGE, as a result of this move toward safer investments. From the technical perspective, Dogecoin's future appears uncertain. The price action has clearly broken below the moving averages of 50, 100 and 200 days.\n\nThe oversold zone, which is currently below 33, has been reached by even short-term momentum indicators like the RSI, indicating significant bearish pressure. Volume increases that coincide with the decline further demonstrate that this is a larger derisking trend by both institutional and retail players rather than merely a flash correction. Going forward, $0.12, a zone that [DOGE](https://u.today/dogecoin-doge-3-key-levels-to-track-shiba-inu-shib-price-foundation-reached-solana-sol-stronger) previously consolidated around in mid-2023, is a crucial support level to keep an eye on.\n\nFurther declines toward $0.10 or even $0.08 may be possible if this level breaks. However, a possible relief rally toward the $0.16-$0.17 range could occur if bulls are able to hold the line and swiftly reclaim $0.14, particularly if the macro environment calms. A sustained recovery might take some time, and volatility is likely to stay high until DOGE finds a stable floor or market sentiment improves.\n"
}